nxp-mcuxpresso/mcux-soc-svd/KW45B41Z52/KW45B41Z52.xml
        <register>
          <name>LPM_CTRL</name>
          <description>PLL Low Port Modulator Control</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_LD_MANUAL</name>
              <description>Manual PLL Loop Divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_SCALE</name>
              <description>High Port Calibration Word Scaling</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_0</name>
                  <description>No Scaling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_1</name>
                  <description>No Scaling</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_2</name>
                  <description>No Scaling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_3</name>
                  <description>Divide by 32</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_4</name>
                  <description>Divide by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_5</name>
                  <description>Divide by 8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_6</name>
                  <description>Divide by 4</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_7</name>
                  <description>Divide by 2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_8</name>
                  <description>No Scaling</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_9</name>
                  <description>Multiply by 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_10</name>
                  <description>Multiply by 4</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_11</name>
                  <description>Multiply by 8</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_12</name>
                  <description>No Scaling</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_13</name>
                  <description>No Scaling</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_14</name>
                  <description>No Scaling</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_SCALE_15</name>
                  <description>No Scaling</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_LD_DISABLE</name>
              <description>Disable PLL Loop Divider</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPFF</name>
              <description>LPM SDM Invalid Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LPM_SDM_INV</name>
              <description>Invert LPM SDM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_DISABLE</name>
              <description>Disable LPM SDM</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_DTH_SCL</name>
              <description>LPM Dither Scale</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_5</name>
                  <description>-128 to 96</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_6</name>
                  <description>-256 to 192</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_7</name>
                  <description>-512 to 384</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_8</name>
                  <description>-1024 to 768</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_9</name>
                  <description>-2048 to 1536</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_10</name>
                  <description>-4096 to 3072</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DTH_SCL_11</name>
                  <description>-8192 to 6144</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_D_CTRL</name>
              <description>LPM Dither Control in Override Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_D_OVRD</name>
              <description>LPM Dither Override Mode Select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_SCALE</name>
              <description>LPM Scale Factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SCALE_0</name>
                  <description>No Scaling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_1</name>
                  <description>Multiply by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_2</name>
                  <description>Multiply by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_3</name>
                  <description>Multiply by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_4</name>
                  <description>Multiply by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_5</name>
                  <description>Multiply by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_6</name>
                  <description>Multiply by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_7</name>
                  <description>Multiply by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_8</name>
                  <description>Multiply by 256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_9</name>
                  <description>Multiply by 512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_10</name>
                  <description>Multiply by 1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_SCALE_11</name>
                  <description>Multiply by 2048</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_SDM_USE_NEG</name>
              <description>Use the Negedge of the Sigma Delta clock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_SDM_CTRL1</name>
          <description>PLL Low Port Sigma Delta Control 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_INTG_SELECTED</name>
              <description>Low Port Modulation Integer Value Selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HPM_ARRAY_BIAS</name>
              <description>Bias value for High Port DAC Array Midpoint</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_INTG</name>
              <description>Manual Low Port Modulation Integer Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDM_MAP_DISABLE</name>
              <description>Disable SDM Mapping</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_SDM_CTRL2</name>
          <description>PLL Low Port Sigma Delta Control 2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_NUM</name>
              <description>Low Port Modulation Numerator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_SDM_CTRL3</name>
          <description>PLL Low Port Sigma Delta Control 3</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_DENOM</name>
              <description>Low Port Modulation Denominator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_SDM_RES1</name>
          <description>PLL Low Port Sigma Delta Result 1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_NUM_SELECTED</name>
              <description>Low Port Modulation Numerator Applied</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_SDM_RES2</name>
          <description>PLL Low Port Sigma Delta Result 2</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_DENOM_SELECTED</name>
              <description>Low Port Modulation Denominator Selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_MATCH</name>
          <description>PLL Delay Matching</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x204</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_SDM_DELAY</name>
              <description>Low Port SDM Delay Matching</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SDM_DELAY</name>
              <description>High Port SDM Delay Matching</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_INTEGER_DELAY</name>
              <description>High Port Integer Delay Matching</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TUNING_CAP_TX_CTRL</name>
          <description>Tuning Cap Settings in Transmit Mode</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6DB6DB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNING_RANGE_0</name>
              <description>Tuning Range 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_1</name>
              <description>Tuning Range 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_2</name>
              <description>Tuning Range 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_3</name>
              <description>Tuning Range 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_4</name>
              <description>Tuning Range 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_5</name>
              <description>Tuning Range 5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_6</name>
              <description>Tuning Range 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_7</name>
              <description>Tuning Range 7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TUNING_CAP_RX_CTRL</name>
          <description>Tuning Cap Settings in Receive Mode</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6DB6DB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNING_RANGE_0</name>
              <description>Tuning Range 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_1</name>
              <description>Tuning Range 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_2</name>
              <description>Tuning Range 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_3</name>
              <description>Tuning Range 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_4</name>
              <description>Tuning Range 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_5</name>
              <description>Tuning Range 5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_6</name>
              <description>Tuning Range 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_7</name>
              <description>Tuning Range 7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX_TX_CFG1_FREQ</name>
          <description>Max Transmit Frequency For TX Configuration 1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX_TX_CFG1_FREQ</name>
              <description>Maximum Transmit Frequency for Standard TX Settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTUNE_CTRL</name>
          <description>PLL Coarse Tune Control</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTUNE_TARGET_MANUAL</name>
              <description>Manual Coarse Tune Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_CNTR_RLS_RST</name>
              <description>Coarse Tune Counter Release Reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_TARGET_DISABLE</name>
              <description>Disable Coarse Tune Target</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_ADJUST</name>
              <description>Coarse Tune Count Adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_MANUAL</name>
              <description>Manual Coarse Tune Setting</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_DISABLE</name>
              <description>Coarse Tune Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
