nxp-mcuxpresso/mcux-soc-svd/KW45B41Z52/KW45B41Z52.xml
        <register>
          <name>TX_DAC_PA</name>
          <description>RF Analog TX DAC PA Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAC_INVERT_CLK</name>
              <description>reg_dac_invert_clk_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_TRIM_RLOAD</name>
              <description>reg_dac_trim_rload_dig[1:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_0</name>
                  <description>3K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_1</name>
                  <description>2.25K</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_2</name>
                  <description>3.75K</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_RLOAD_3</name>
                  <description>4.5K</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC_TRIM_IBIAS</name>
              <description>reg_dac_trim_ibias_dig[1:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_0</name>
                  <description>3.0uA (I_lsb=250nA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_1</name>
                  <description>2.5uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_2</name>
                  <description>3.8uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_IBIAS_3</name>
                  <description>5.0uA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_PA_VBIAS</name>
              <description>reg_tx_pa_vbias_dig[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_0</name>
                  <description>0.460V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_1</name>
                  <description>0.431V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_2</name>
                  <description>0.403V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_PA_VBIAS_3</name>
                  <description>0.375V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC_TRIM_CFBK</name>
              <description>reg_dac_trim_cfbk_dig[1:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_0</name>
                  <description>675fF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_1</name>
                  <description>1.35pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_2</name>
                  <description>1.35pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_3</name>
                  <description>2.025pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC_TRIM_CFBK_DRS</name>
              <description>reg_dac_trim_cfbk_dig[1:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_0</name>
                  <description>675fF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_1</name>
                  <description>1.35pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_2</name>
                  <description>1.35pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_TRIM_CFBK_DRS_3</name>
                  <description>2.025pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIAG</name>
          <description>RF Analog DIAG Control 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIAG_CODE</name>
              <description>reg_diag_code_dig[2:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_DIAG_SEL</name>
              <description>reg_ldo_cal_diag_sel_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_VCO_DIAG_SEL</name>
              <description>reg_ldo_vco_diag_sel_dig</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_DIAG_SEL</name>
              <description>reg_ldo_pll_diag_sel_dig</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXLF_DIAG_SEL</name>
              <description>reg_ldo_rxtxlf_diag_sel_dig</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXHF_DIAG_SEL</name>
              <description>reg_ldo_rxtxhf_diag_sel_dig</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_LV_DIAG_SEL</name>
              <description>reg_ldo_lv_diag_sel_dig</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DIAG_SEL</name>
              <description>reg_bg_diag_sel_dig</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOTRIM_DIAG_SEL</name>
              <description>reg_ldotrim_diag_sel_dig</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_MON_DIAG_SEL</name>
              <description>reg_proc_mon_diag_sel_dig</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTFE_DIAG_SEL</name>
              <description>reg_rtfe_diag_sel_dig</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_I_DIAG_SEL_1</name>
              <description>reg_cbpf_i_diag_sel_1_dig</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_I_DIAG_SEL_2</name>
              <description>reg_cbpf_i_diag_sel_2_dig</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_Q_DIAG_SEL_1</name>
              <description>reg_cbpf_q_diag_sel_1_dig</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_Q_DIAG_SEL_2</name>
              <description>reg_cbpf_q_diag_sel_2_dig</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBPF_EN_DIAG_MEAS</name>
              <description>reg_cbpf_en_diag_meas_dig</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DIAG_SEL</name>
              <description>reg_adc_diag_sel_dig</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_DIAG_SEL</name>
              <description>reg_pd_diag_sel_dig</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_DIAG_SEL</name>
              <description>reg_vco_diag_sel_dig</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_DIAG_SEL</name>
              <description>reg_dac_diag_sel_dig</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XO_DIST_DIAG_SEL</name>
              <description>reg_xo_dist_diag_sel_dig</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_ANT_DIAG_SEL</name>
              <description>reg_ldo_ant_diag_sel_dig</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_AMP_DIAG_SEL</name>
              <description>reg_dac_amp_diag_sel_dig</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAG_DIS</name>
              <description>reg_diag_dis_dig</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATX_ON_2P4GHZ</name>
              <description>reg_2p4ghz_atx_on_dig</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPARE</name>
          <description>RF Analog SPARE Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPARELV</name>
              <description>reg_sparelv_dig[1:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE_DIAG_SEL</name>
              <description>reg_spare_diag_sel_dig[1:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
