nxp-mcuxpresso/mcux-soc-svd/KW45B41Z52/KW45B41Z52.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TX_PACKET_RAM</name>
      <description>RADIO_PACKET_RAM</description>
      <groupName>TX_PACKET_RAM</groupName>
      <baseAddress>0x48A08000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>1024</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PACKET_RAM_[%s]</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RX_PACKET_RAM</name>
      <description>RADIO_PACKET_RAM</description>
      <groupName>RX_PACKET_RAM</groupName>
      <baseAddress>0x48A09000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>512</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PACKET_RAM_[%s]</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ITM</name>
      <description>Instrumentation Trace Macrocell Registers</description>
      <groupName>ITM</groupName>
      <prependToName>ITM_</prependToName>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STIM0_READ</name>
          <description>Stimulus Port Register 0 (for reading)</description>
          <alternateGroup>STIM0_READ_STIM0_WRITE</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM0_WRITE</name>
          <description>Stimulus Port Register 0 (for writing)</description>
          <alternateGroup>STIM0_READ_STIM0_WRITE</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM1_READ</name>
          <description>Stimulus Port Register 1 (for reading)</description>
          <alternateGroup>STIM1_READ_STIM1_WRITE</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM1_WRITE</name>
          <description>Stimulus Port Register 1 (for writing)</description>
          <alternateGroup>STIM1_READ_STIM1_WRITE</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM2_READ</name>
          <description>Stimulus Port Register 2 (for reading)</description>
          <alternateGroup>STIM2_READ_STIM2_WRITE</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM2_WRITE</name>
          <description>Stimulus Port Register 2 (for writing)</description>
          <alternateGroup>STIM2_READ_STIM2_WRITE</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM3_READ</name>
          <description>Stimulus Port Register 3 (for reading)</description>
          <alternateGroup>STIM3_READ_STIM3_WRITE</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM3_WRITE</name>
          <description>Stimulus Port Register 3 (for writing)</description>
          <alternateGroup>STIM3_READ_STIM3_WRITE</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM4_READ</name>
          <description>Stimulus Port Register 4 (for reading)</description>
          <alternateGroup>STIM4_READ_STIM4_WRITE</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM4_WRITE</name>
          <description>Stimulus Port Register 4 (for writing)</description>
          <alternateGroup>STIM4_READ_STIM4_WRITE</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM5_READ</name>
          <description>Stimulus Port Register 5 (for reading)</description>
          <alternateGroup>STIM5_READ_STIM5_WRITE</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM5_WRITE</name>
          <description>Stimulus Port Register 5 (for writing)</description>
          <alternateGroup>STIM5_READ_STIM5_WRITE</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM6_READ</name>
          <description>Stimulus Port Register 6 (for reading)</description>
          <alternateGroup>STIM6_READ_STIM6_WRITE</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM6_WRITE</name>
          <description>Stimulus Port Register 6 (for writing)</description>
          <alternateGroup>STIM6_READ_STIM6_WRITE</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM7_READ</name>
          <description>Stimulus Port Register 7 (for reading)</description>
          <alternateGroup>STIM7_READ_STIM7_WRITE</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM7_WRITE</name>
          <description>Stimulus Port Register 7 (for writing)</description>
          <alternateGroup>STIM7_READ_STIM7_WRITE</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM8_READ</name>
          <description>Stimulus Port Register 8 (for reading)</description>
          <alternateGroup>STIM8_READ_STIM8_WRITE</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM8_WRITE</name>
          <description>Stimulus Port Register 8 (for writing)</description>
          <alternateGroup>STIM8_READ_STIM8_WRITE</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM9_READ</name>
          <description>Stimulus Port Register 9 (for reading)</description>
          <alternateGroup>STIM9_READ_STIM9_WRITE</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM9_WRITE</name>
          <description>Stimulus Port Register 9 (for writing)</description>
          <alternateGroup>STIM9_READ_STIM9_WRITE</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM10_READ</name>
          <description>Stimulus Port Register 10 (for reading)</description>
          <alternateGroup>STIM10_READ_STIM10_WRITE</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM10_WRITE</name>
          <description>Stimulus Port Register 10 (for writing)</description>
          <alternateGroup>STIM10_READ_STIM10_WRITE</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM11_READ</name>
          <description>Stimulus Port Register 11 (for reading)</description>
          <alternateGroup>STIM11_READ_STIM11_WRITE</alternateGroup>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM11_WRITE</name>
          <description>Stimulus Port Register 11 (for writing)</description>
          <alternateGroup>STIM11_READ_STIM11_WRITE</alternateGroup>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM12_READ</name>
          <description>Stimulus Port Register 12 (for reading)</description>
          <alternateGroup>STIM12_READ_STIM12_WRITE</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM12_WRITE</name>
          <description>Stimulus Port Register 12 (for writing)</description>
          <alternateGroup>STIM12_READ_STIM12_WRITE</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM13_READ</name>
          <description>Stimulus Port Register 13 (for reading)</description>
          <alternateGroup>STIM13_READ_STIM13_WRITE</alternateGroup>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM13_WRITE</name>
          <description>Stimulus Port Register 13 (for writing)</description>
          <alternateGroup>STIM13_READ_STIM13_WRITE</alternateGroup>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data write to the stimulus port FIFO, for forwarding as a software event packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM14_READ</name>
          <description>Stimulus Port Register 14 (for reading)</description>
          <alternateGroup>STIM14_READ_STIM14_WRITE</alternateGroup>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FIFOREADY</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
