nxp-mcuxpresso/mcux-soc-svd/KW45B41Z52/KW45B41Z52.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>FPB</name>
      <description>Flash Patch and Breakpoint Unit Registers</description>
      <groupName>FPB</groupName>
      <prependToName>FP_</prependToName>
      <baseAddress>0xE0002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>FlashPatch Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x130</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for the FPB. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>FPB disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>FPB enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY bit. On any write to FP_CTRL, the FPB unit ignores the write unless this bit is 1. This bit is RAZ.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_CODE_least</name>
              <description>NUM_CODE[3:0]. The least significant bits of NUM_CODE, the number of instruction address comparators. If NUM_CODE[6:0] is zero, the implementation does not support any instruction address comparators.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_LIT</name>
              <description>NUM_LIT bits. The number of literal address comparators supported. If this field is zero, the implementation does not support literal comparators.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_CODE_most</name>
              <description>NUM_CODE[6:4]. The most significant bits of NUM_CODE, the number of instruction address comparators, see bits [7:4].</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP</name>
          <description>FlashPatch Remap Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMAP</name>
              <description>REMAP bits. If the FPB supports flash patch remap, this field: - holds bits [28:5] of the base address in SRAM to which the FPB remaps the address - has an UNKNOWN value on reset. If the FPB only supports breakpoint functionality this field is UNK/SBZP.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMPSPT</name>
              <description>RMPSPT bit. Indicates whether the FPB unit supports flash patch remap.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RMPSPT_0</name>
                  <description>Remapping not supported. The FPB only supports breakpoint functionality.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMPSPT_1</name>
                  <description>Hard-wired remap to SRAM region.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0</name>
          <description>FlashPatch Comparator Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP1</name>
          <description>FlashPatch Comparator Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP2</name>
          <description>FlashPatch Comparator Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP3</name>
          <description>FlashPatch Comparator Register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP4</name>
          <description>FlashPatch Comparator Register 4</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0000007</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for this comparator. A Power-on reset clears this bit to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Comparator disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Comparator enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP bits. Bits [28:2] of the address to compare with addresses from the Code memory region. Bits [31:29] and [1:0] of the address for comparison are zero. If a match occurs: - for an instruction address comparator, the REPLACE field defines the required action - for a literal address comparator, the FPB remaps the access. The reset value of this field is UNKNOWN.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPLACE</name>
              <description>REPLACE[1:0]. For an instruction address comparator: - Defines the behavior when the COMP address is matched. - The reset value of this field is UNKNOWN. For a literal address comparator: - Field is UNK/SBZP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REPLACE_0</name>
                  <description>Remap to remap address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_1</name>
                  <description>Breakpoint on lower halfword, upper is unaffected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_2</name>
                  <description>Breakpoint on upper halfword, lower is unaffected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE_3</name>
                  <description>Breakpoint on both lower and upper halfwords.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
