nxp-mcuxpresso/mcux-soc-svd/KW45B41Z52/KW45B41Z52.xml
        <register>
          <name>RBAR_A3</name>
          <description>MPU Region Base Address Register.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>XN</name>
              <description>The XN bit is an Execute Never bit, that indicates whether the processor can execute instructions from the region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXECUTE</name>
                  <description>Execution is only permitted if read permitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTE_NEVER</name>
                  <description>Execution is not permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AP</name>
              <description>The AP[2:0] bits indicate the access and privilege properties of the region.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIVILEGED_CODE</name>
                  <description>Read/write by privileged code only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ANY</name>
                  <description>Read/write by any privilege level.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_CODE_READ_ONLY</name>
                  <description>Read-only by privileged code only.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIVILEGED_ANY_READ_ONLY</name>
                  <description>Read-only by any privilege level.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SH</name>
              <description>For Normal memory regions, the S bit indicates whether the region is shareable. For Strongly-ordered and Device memory, the S bit is ignored.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_SHAREABLE</name>
                  <description>Non-shareable memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNPREDICTABLE</name>
                  <description>Unpredictable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTER_SHAREABLE</name>
                  <description>Outer shareable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INNER_SHAREABLE</name>
                  <description>Inner Shareable.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASE</name>
              <description>Contains bits[31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RLAR_A3</name>
          <description>MPU Region Limit Address Register.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enables this region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Region is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Region is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATTRINDX</name>
              <description>Attribute index. Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LIMIT</name>
              <description>Limit address. Contains bits[31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIR0</name>
          <description>MPU Memory Attribute Indirection Registers 0.</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ATTR0</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR1</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR3</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 3.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIR1</name>
          <description>MPU Memory Attribute Indirection Registers 1.</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ATTR4</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR5</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 5.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR6</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 6.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR7</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 7.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
